---
kind: type
id: T:Autodesk.Revit.DB.ValidateCurveLoopsOptions
source: html/9a7cd776-fbdb-4df7-d06e-642bfbe1445d.htm
---
# Autodesk.Revit.DB.ValidateCurveLoopsOptions

Options for array of curve loops validation.

## Syntax (C#)
```csharp
public class ValidateCurveLoopsOptions : IDisposable
```